app/representers/chat_representer.rb

  def as_json_arr
    chats.map do |chat|
      {
        number: chat.number,
        message_count: chat.message_count,
        token: Application.find_by(id: chat.application_id).token
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = 2 LIMIT 1

  def as_json
    {
      number: chats.number,
      message_count: chats.message_count,
      token: Application.find_by(id: chats.application_id).token
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = 2 LIMIT 1