app/representers/message_representer.rb

SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = 2 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1
---
  def as_json_arr
    messages.map do |message|
      {
        number: message.number,
        body: message.body,
        chat_no: Chat.find_by(id: message.chat_id).number,
        token: Application.find_by(id: Chat.find_by(id: message.chat_id).application_id).token

SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = 2 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1
---
  def as_json
    {
      number: messages.number,
      body: messages.body,
      chat_no: Chat.find_by(id: messages.chat_id).number,
      token: Application.find_by(id: Chat.find_by(id: messages.chat_id).application_id).token