app/controllers/api/v1/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
    def index
      applications = Application.all

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '86e3fd48e17bb7f84855578320e82dc7' LIMIT 1
---
    def show
      app = Application.find_by(token: params[:id])

INSERT INTO `applications` (`token`, `name`, `chat_count`, `created_at`, `updated_at`) VALUES ('52ffa029a887a17e05fea79880db032b', '4 application', 0, '2022-11-16 00:31:13.386325', '2022-11-16 00:31:13.386325')
---
    def create
      application = Application.new(application_params)
      application.token = SecureRandom.hex(16).to_s
      application.chat_count = 0

      if application.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '41c3b8e710de2cc80fe9db37c4210fd2' LIMIT 1
UPDATE `applications` SET `applications`.`name` = 'update 2 application', `applications`.`updated_at` = '2022-11-16 21:30:01.805292' WHERE `applications`.`id` = 2
---
    def update
      app = Application.find_by_token(params[:id])
      if app
        ActiveRecord::Base.transaction do
          app.lock!
          app.update(name: params[:name])