app/controllers/api/v1/chats_controller.rb

SELECT `chats`.* FROM `chats`
---
      def index
        chats = Chat.all

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '338acf3f71decdb7444b22e48c539832' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 1 ORDER BY `chats`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `chats` WHERE `chats`.`application_id` = 7
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2
---
      def show
        app = Application.find_by(token: params[:id])
        if app
          chats = Chat.all.where application_id: app[:id]
          if chats.count > 0

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '41c3b8e710de2cc80fe9db37c4210fd2' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2 ORDER BY `chats`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `chats` WHERE `chats`.`application_id` = 2
INSERT INTO `chats` (`number`, `message_count`, `created_at`, `updated_at`, `application_id`) VALUES (3, 0, '2022-11-16 21:55:11.892393', '2022-11-16 21:55:11.892393', 2)
UPDATE `applications` SET `applications`.`chat_count` = 3, `applications`.`updated_at` = '2022-11-16 21:55:11.898936' WHERE `applications`.`id` = 2
UPDATE `applications` SET `applications`.`chat_count` = 7, `applications`.`updated_at` = '2022-11-16 22:19:52.403887' WHERE `applications`.`id` = 2
---
      def create
        app = Application.find_by_token(params[:token])
        if app
          # only one user shall be allowed to add chats to the application at a time.
          ActiveRecord::Base.transaction do
            app.lock!
            chats = Chat.all.where application_id: app[:id]
            if chats.count > 0
              chat = Chat.new(number: (1+chats.last[:number]) , application: app)
            else
              chat = Chat.new(number: 1 , application: app)
            end
            chat.message_count = 0

            if chat.save
              app.update(chat_count: (chats.count))
              app.save!