app/controllers/api/v1/messages_controller.rb

      def index
        messages = Message.all
---
SELECT `messages`.* FROM `messages`

      def show
        #get the app that contains that chat of the message
        app = Application.find_by_token(params[:id])
        if app
          #get the chat of the message
          chats = Chat.where application_id: app[:id]
          current_chat = chats.find_by_number(params[:chat_no])
          if current_chat
            #get the messages of that chat
            messages = Message.where chat_id: current_chat[:id]
            if messages.count > 0
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '338acf3f71decdb7444b22e48c539832' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 4 ORDER BY `chats`.`id` ASC LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 7 AND `chats`.`number` = 3 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 14 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `messages` WHERE `messages`.`chat_id` = 27

      def create
        #get the application that contains that chat of the message
        app = Application.find_by_token(params[:token])
        if app
          #get the chat of the message
          chats = Chat.all.where application_id: app[:id]
          current_chat = chats.find_by_number(params[:chat_no])
          if current_chat.nil?
            render json: "chat no is not found for that application" , status: :not_found
          else
            #lock the chat while creating the new message
            ActiveRecord::Base.transaction do
              current_chat.lock!
              messages = Message.all.where chat_id: current_chat[:id]
              if messages.count > 0
                message = Message.new(body: params[:message], number: (1 + messages.last.number), chat: current_chat)
              else
                message = Message.new(body: params[:message], number: 1, chat: current_chat)
              end
              if message.save
                #update the message count in the chat
                current_chat.update(message_count: messages.count)
                current_chat.save!
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'a591351a89a567dc51fff85cf174b43f' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2 ORDER BY `chats`.`id` ASC LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 8 AND `chats`.`number` = 2 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 27 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `messages` WHERE `messages`.`chat_id` = 20
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 20 ORDER BY `messages`.`id` DESC LIMIT 1
INSERT INTO `messages` (`body`, `number`, `created_at`, `updated_at`, `chat_id`) VALUES ('message 3', 2, '2022-11-17 01:10:08.213056', '2022-11-17 01:10:08.213056', 20)
UPDATE `chats` SET `chats`.`message_count` = 2, `chats`.`updated_at` = '2022-11-17 01:10:08.222938' WHERE `chats`.`id` = 20
UPDATE `messages` SET `messages`.`body` = 'new message body', `messages`.`updated_at` = '2022-11-15 23:27:32.151171' WHERE `messages`.`id` = 5

      def update
        #get the app that contain the chat of the message
        app = Application.find_by_token(params[:id])
        if app
          #get the chat of the message
          chats = Chat.where application_id: app[:id]
          current_chat = chats.find_by_number(params[:chat_no])
          if current_chat.nil?
            render json: "chat no is not found for that application" , status: :not_found
          else
            messages = Message.where chat_id: current_chat[:id]
            message = messages.find_by_number(params[:message_id])

            if message
              #lock the message while editing
              ActiveRecord::Base.transaction do
                message.lock!
                message.update(body: params[:body])
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'a591351a89a567dc51fff85cf174b43f' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 8 AND `chats`.`number` = 2 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 20 AND `messages`.`number` = 1 LIMIT 1
UPDATE `messages` SET `messages`.`body` = 'new body', `messages`.`updated_at` = '2022-11-17 00:59:04.230380' WHERE `messages`.`id` = 10